#+title: Labs: Data8 Foundations of Data Science

*** calculation
#+begin_src python
  print(3*4)
  print(3**4)
#+end_src

#+RESULTS:
: 12
: 81

*** don't use method as name
- max
- min
- abs

#+begin_src python
  max = 13
  print(max)
  # max(4,6)

#+end_src

#+RESULTS:
: 13

#+begin_src python
  max = 13
  print(max)
  max(4,6)
#+end_src

*** floor

calculate the largest integer no larger than the specific nmber
#+begin_src python
  print(math.floor(4))
  print(math.floor(4.5))
#+end_src

#+RESULTS:
: 4
: 4

*** logarithm

#+begin_src python
  # math.log(num, base)
  a = math.log(8, 2)
  print(a)
#+end_src

#+RESULTS:
: 3.0

*** special import

#+begin_src python :prologue ""
  from math import log
  print(log(8,2))

  print(math.floor(4.5))

#+end_src

#+RESULTS:
: 3.0


#+begin_src python :prologue ""
  from math import *

  print(log(8,2))
  print(floor(4.5))
#+end_src

#+RESULTS:
: 3.0
: 4




*** read

#+begin_src python
  from datascience import *
  import pkg_resources

  farmers_markets = Table.read_table('./materials-sp25/lab/lab02/farmers_markets.csv')

  farmers_markets.show(3)
#+end_src

#+RESULTS:
: <IPython.core.display.HTML object>

*** q11

#+begin_src python
  a = 2**6 - 2**11 - 2**5
  b = 5*13*31+10
  new_year = max(a,b)
  print(new_year)
#+end_src

#+RESULTS:
: 2025

*** q21

#+begin_src python
  import math
  near_twenty = math.e ** math.pi - math.pi
  print(near_twenty)
#+end_src

#+RESULTS:
: 19.99909997918947

*** q211
#+begin_src python
  import math
  floor_of_pi = math.floor(math.pi)
  print(floor_of_pi)
#+end_src

#+RESULTS:
: 3
